README.org
# -*- mode:org; coding: utf-8; -*-
#+TITLE: Prady_sh_scripts
#+AUTHOR: Pradyumna Paranjape
#+EMAIL: pradyparanjpe@rediffmail.com
#+LANGUAGE: en
#+OPTIONS: toc:2 num:nil html-postamble:nil ^:nil mathjax:t TeX:t ::t tags:nil *:t skip:t
#+PROPERTY: header-args :tangle no
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+EXPORT_FILE_NAME: docs/prady_sh_scripts.html
#+MAN_CLASS_OPTIONS: :section-id 7

* Whats this?
Useful (according to me) shell-scripts

* Documentation
[[http://pradyparanjpe.gitlab.io/sh_scripts/index.html][pages]]

* How to install
** Linux / Unix
- Download tangled code from [[http://pradyparanjpe.gitlab.io/sh_scripts/pss][here]].
- Place it at a location, ~LOC~.
  - ~LOC~ may be something of the form =~/Downloads/pss/= use the correct location.
- Place the following code at the end of either =~/.zshrc= or =~/.bashrc= or both; replace =LOC= appropriately.
#+begin_src sh :tangle no :exports none
  PATH="${PATH}:LOC/bin"
#+end_src

* NAME
prady_sh_scripts - useful shell scripts written by Pradyumna Paranjape.

* Copyright
  Copyright 2020-2022 Pradyumna Paranjape

* License (GNU GPLv3)
  This file is part of Prady_sh_scripts.
  Prady_sh_scripts is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Prady_sh_scripts is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Prady_sh_scripts.  If not, see <https://www.gnu.org/licenses/>.

* Scope
  Files in this project contain regular utilities and aliases for linux (fc35);
  Preferably in POSIX-compliant shell scripts.

* Configuration
  Variable values may be set manually in
  =${XDG_CONFIG_HOME:-${HOME/.config}}/sh_scripts/config.sh=.
  A variable named =<var>= for as script =<script>= can be set by
  declaring =<script>_<var>=<value>=.
  It will be interpreted as =<var>=<value>= only by *that* script,
  ignoring all other variables.

** Example
  #+begin_src sh :tangle no
    # shellcheck disable=SC2034
    countdown_progress=true
  #+end_src

** List of variables
  Following variables may be set for the corresponding script.

  #+begin_warn
  It may not be wise to configure some of them globally.
  #+end_warn

*** [[file:clear_cache.org][clear_cache]]
   - clear_cache_confirmed: /bool/

*** [[file:countdown.org][countdown]]
   - countdown_colors: /bool/
   - countdown_resolution: /int/
   - countdown_notify: /bool/
   - countdown_progress: /bool/
   - countdown_period: /datatime/
   - countdown_as_time: /bool/

*** [[file:gen_self_ssl_cert.org][gen_self_ssl_cert]]
   - gen_self_ssl_cert_conf: /path/
   - gen_self_ssl_cert_ssl_root: /path/
   - gen_self_ssl_cert_keyname: /str/
   - gen_self_ssl_cert_validity: /int/
   - gen_self_ssl_cert_create_conf: /bool/

*** [[file:get_pass.org][get_pass]]
   - get_pass_instance: /str/

*** [[file:git_migrate.org][git_migrate]]
   - git_migrate_conf: /path/
   - git_migrate_task: /str/
   - git_migrate_rroot: /path/
   - git_migrate_stale: /url/ | /path/
   - git_migrate_rnew: /url/ | /path/

*** [[file:mvlns.org][mvlns]]
   - mvlns_verbose:  /bool/
   - mvlns_srcdir: /path/
   - mvlns_object: /path/
   - mvlns_destin: /path/
   - mvlns_mk_par: /bool/

*** [[file:openvpn.org][openvpn]]
   - openvpn_remote_targets: /str/ (addresses separated by =space=)

*** [[file:relink.org][relink]]
   - relink_verbose: /bool/
   - relink_link_dir: /path/
   - relink_mod_pat: /glob/
   - relink_new_str:  /str/
   - relink_mock: /bool/
   - relink_safe: /bool/

*** [[file:runAs.org][runAs]]
   - runAs_otherUser: /str/
   - runAs_otherIP: /url/
   - runAs_execCmd: /str/
   - runAs_posStr: /str/
   - runAs_titleStr: /str/
   - runAs_interactive: /bool/

*** [[file:scan_network_upnodes.org][scan_network_upnodes]]
   - scan_network_upnodes_ip_range: /int/
   - scan_network_upnodes_startip: /int/
   - scan_network_upnodes_stopip: /int/
   - scan_network_upnodes_down: /bool/

*** [[file:snatch_own.org][snatch_own]]
   - snatch_own_verbose: /bool/
   - snatch_own_robber: /str/
   - snatch_own_syndicate: /str/
   - snatch_own_recurse: /bool/

*** [[file:sync_gitlab_issues.org][sync_gitlab_issues]]
   - sync_gitlab_issues_verbose: /bool/
   - sync_gitlab_issues_very_verbose: /bool/
   - sync_gitlab_issues_config_file: /path/
   - sync_gitlab_issues_pull: /bool/
   - sync_gitlab_issues_block: /str/
   - sync_gitlab_issues_local_url: /path/
   - sync_gitlab_issues_local_token: /str/
   - sync_gitlab_issues_remote_url: /url/
   - sync_gitlab_issues_remote_token: /str/

*** [[file:update_date.org][update_date]]
   - update_date_set_time: /bool/
   - update_date_current_time: /str/
   - update_date_source: /url/

