docs/prady_sh_scripts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-08 Thu 23:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prady_sh_scripts</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Prady_sh_scripts</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdcc05f8">Whats this?</a></li>
<li><a href="#org7870b26">Documentation</a></li>
<li><a href="#orgbeadb9a">How to install</a>
<ul>
<li><a href="#org385acf0">Linux / Unix</a></li>
</ul>
</li>
<li><a href="#org57eb776">NAME</a></li>
<li><a href="#org24462eb">Copyright</a></li>
<li><a href="#org3cde32c">License (GNU GPLv3)</a></li>
<li><a href="#org24c56f4">Scope</a></li>
<li><a href="#org3699a97">Configuration</a>
<ul>
<li><a href="#orgce27fa8">Example</a></li>
<li><a href="#org22abe82">List of variables</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdcc05f8" class="outline-2">
<h2 id="orgdcc05f8">Whats this?</h2>
<div class="outline-text-2" id="text-orgdcc05f8">
<p>
Useful (according to me) shell-scripts
</p>
</div>
</div>

<div id="outline-container-org7870b26" class="outline-2">
<h2 id="org7870b26">Documentation</h2>
<div class="outline-text-2" id="text-org7870b26">
<p>
<a href="http://pradyparanjpe.gitlab.io/sh_scripts/index.html">pages</a>
</p>
</div>
</div>

<div id="outline-container-orgbeadb9a" class="outline-2">
<h2 id="orgbeadb9a">How to install</h2>
<div class="outline-text-2" id="text-orgbeadb9a">
</div>
<div id="outline-container-org385acf0" class="outline-3">
<h3 id="org385acf0">Linux / Unix</h3>
<div class="outline-text-3" id="text-org385acf0">
<ul class="org-ul">
<li>Download tangled code from <a href="http://pradyparanjpe.gitlab.io/sh_scripts/pss">here</a>.</li>
<li>Place it at a location, <code>LOC</code>.
<ul class="org-ul">
<li><code>LOC</code> may be something of the form <code>~/Downloads/pss/</code> use the correct location.</li>
</ul></li>
<li>Place the following code at the end of either <code>~/.zshrc</code> or <code>~/.bashrc</code> or both; replace <code>LOC</code> appropriately.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org57eb776" class="outline-2">
<h2 id="org57eb776">NAME</h2>
<div class="outline-text-2" id="text-org57eb776">
<p>
prady_sh_scripts - useful shell scripts written by Pradyumna Paranjape.
</p>
</div>
</div>

<div id="outline-container-org24462eb" class="outline-2">
<h2 id="org24462eb">Copyright</h2>
<div class="outline-text-2" id="text-org24462eb">
<p>
Copyright 2020-2022 Pradyumna Paranjape
</p>
</div>
</div>

<div id="outline-container-org3cde32c" class="outline-2">
<h2 id="org3cde32c">License (GNU GPLv3)</h2>
<div class="outline-text-2" id="text-org3cde32c">
<p>
This file is part of Prady_sh_scripts.
Prady_sh_scripts is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.
</p>

<p>
Prady_sh_scripts is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.
</p>

<p>
You should have received a copy of the GNU General Public License
along with Prady_sh_scripts.  If not, see <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>.
</p>
</div>
</div>

<div id="outline-container-org24c56f4" class="outline-2">
<h2 id="org24c56f4">Scope</h2>
<div class="outline-text-2" id="text-org24c56f4">
<p>
Files in this project contain regular utilities and aliases for linux (fc35);
Preferably in POSIX-compliant shell scripts.
</p>
</div>
</div>

<div id="outline-container-org3699a97" class="outline-2">
<h2 id="org3699a97">Configuration</h2>
<div class="outline-text-2" id="text-org3699a97">
<p>
Variable values may be set manually in
<code>${XDG_CONFIG_HOME:-${HOME/.config}}/sh_scripts/config.sh</code>.
A variable named <code>&lt;var&gt;</code> for as script <code>&lt;script&gt;</code> can be set by
declaring <code>&lt;script&gt;_&lt;var&gt;=&lt;value&gt;</code>.
It will be interpreted as <code>&lt;var&gt;=&lt;value&gt;</code> only by <b>that</b> script,
ignoring all other variables.
</p>
</div>

<div id="outline-container-orgce27fa8" class="outline-3">
<h3 id="orgce27fa8">Example</h3>
<div class="outline-text-3" id="text-orgce27fa8">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2034</span>
<span style="color: #ffffaf;">countdown_progress</span>=true
</pre>
</div>
</div>
</div>

<div id="outline-container-org22abe82" class="outline-3">
<h3 id="org22abe82">List of variables</h3>
<div class="outline-text-3" id="text-org22abe82">
<p>
Following variables may be set for the corresponding script.
</p>

<div class="warn" id="org737e8d0">
<p>
It may not be wise to configure some of them globally.
</p>

</div>
</div>

<div id="outline-container-org5b12bdc" class="outline-4">
<h4 id="org5b12bdc"><a href="clear_cache.html">clear_cache</a></h4>
<div class="outline-text-4" id="text-org5b12bdc">
<ul class="org-ul">
<li>clear_cache_confirmed: <i>bool</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgedb49cb" class="outline-4">
<h4 id="orgedb49cb"><a href="countdown.html">countdown</a></h4>
<div class="outline-text-4" id="text-orgedb49cb">
<ul class="org-ul">
<li>countdown_colors: <i>bool</i></li>
<li>countdown_resolution: <i>int</i></li>
<li>countdown_notify: <i>bool</i></li>
<li>countdown_progress: <i>bool</i></li>
<li>countdown_period: <i>datatime</i></li>
<li>countdown_as_time: <i>bool</i></li>
</ul>
</div>
</div>

<div id="outline-container-orga48601e" class="outline-4">
<h4 id="orga48601e"><a href="gen_self_ssl_cert.html">gen_self_ssl_cert</a></h4>
<div class="outline-text-4" id="text-orga48601e">
<ul class="org-ul">
<li>gen_self_ssl_cert_conf: <i>path</i></li>
<li>gen_self_ssl_cert_ssl_root: <i>path</i></li>
<li>gen_self_ssl_cert_keyname: <i>str</i></li>
<li>gen_self_ssl_cert_validity: <i>int</i></li>
<li>gen_self_ssl_cert_create_conf: <i>bool</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgef27aa6" class="outline-4">
<h4 id="orgef27aa6"><a href="get_pass.html">get_pass</a></h4>
<div class="outline-text-4" id="text-orgef27aa6">
<ul class="org-ul">
<li>get_pass_instance: <i>str</i></li>
</ul>
</div>
</div>

<div id="outline-container-org9ab39a7" class="outline-4">
<h4 id="org9ab39a7"><a href="git_migrate.html">git_migrate</a></h4>
<div class="outline-text-4" id="text-org9ab39a7">
<ul class="org-ul">
<li>git_migrate_conf: <i>path</i></li>
<li>git_migrate_task: <i>str</i></li>
<li>git_migrate_rroot: <i>path</i></li>
<li>git_migrate_stale: <i>url</i> | <i>path</i></li>
<li>git_migrate_rnew: <i>url</i> | <i>path</i></li>
</ul>
</div>
</div>

<div id="outline-container-org5d574c5" class="outline-4">
<h4 id="org5d574c5"><a href="mvlns.html">mvlns</a></h4>
<div class="outline-text-4" id="text-org5d574c5">
<ul class="org-ul">
<li>mvlns_verbose:  <i>bool</i></li>
<li>mvlns_srcdir: <i>path</i></li>
<li>mvlns_object: <i>path</i></li>
<li>mvlns_destin: <i>path</i></li>
<li>mvlns_mk_par: <i>bool</i></li>
</ul>
</div>
</div>

<div id="outline-container-org04a3a1d" class="outline-4">
<h4 id="org04a3a1d"><a href="openvpn.html">openvpn</a></h4>
<div class="outline-text-4" id="text-org04a3a1d">
<ul class="org-ul">
<li>openvpn_remote_targets: <i>str</i> (addresses separated by <code>space</code>)</li>
</ul>
</div>
</div>

<div id="outline-container-org1f68fec" class="outline-4">
<h4 id="org1f68fec"><a href="relink.html">relink</a></h4>
<div class="outline-text-4" id="text-org1f68fec">
<ul class="org-ul">
<li>relink_verbose: <i>bool</i></li>
<li>relink_link_dir: <i>path</i></li>
<li>relink_mod_pat: <i>glob</i></li>
<li>relink_new_str:  <i>str</i></li>
<li>relink_mock: <i>bool</i></li>
<li>relink_safe: <i>bool</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgc38999a" class="outline-4">
<h4 id="orgc38999a"><a href="runAs.html">runAs</a></h4>
<div class="outline-text-4" id="text-orgc38999a">
<ul class="org-ul">
<li>runAs_otherUser: <i>str</i></li>
<li>runAs_otherIP: <i>url</i></li>
<li>runAs_execCmd: <i>str</i></li>
<li>runAs_posStr: <i>str</i></li>
<li>runAs_titleStr: <i>str</i></li>
<li>runAs_interactive: <i>bool</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgc9b170f" class="outline-4">
<h4 id="orgc9b170f"><a href="scan_network_upnodes.html">scan_network_upnodes</a></h4>
<div class="outline-text-4" id="text-orgc9b170f">
<ul class="org-ul">
<li>scan_network_upnodes_ip_range: <i>int</i></li>
<li>scan_network_upnodes_startip: <i>int</i></li>
<li>scan_network_upnodes_stopip: <i>int</i></li>
<li>scan_network_upnodes_down: <i>bool</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgea8df98" class="outline-4">
<h4 id="orgea8df98"><a href="snatch_own.html">snatch_own</a></h4>
<div class="outline-text-4" id="text-orgea8df98">
<ul class="org-ul">
<li>snatch_own_verbose: <i>bool</i></li>
<li>snatch_own_robber: <i>str</i></li>
<li>snatch_own_syndicate: <i>str</i></li>
<li>snatch_own_recurse: <i>bool</i></li>
</ul>
</div>
</div>

<div id="outline-container-org559e41d" class="outline-4">
<h4 id="org559e41d"><a href="sync_gitlab_issues.html">sync_gitlab_issues</a></h4>
<div class="outline-text-4" id="text-org559e41d">
<ul class="org-ul">
<li>sync_gitlab_issues_verbose: <i>bool</i></li>
<li>sync_gitlab_issues_very_verbose: <i>bool</i></li>
<li>sync_gitlab_issues_config_file: <i>path</i></li>
<li>sync_gitlab_issues_pull: <i>bool</i></li>
<li>sync_gitlab_issues_block: <i>str</i></li>
<li>sync_gitlab_issues_local_url: <i>path</i></li>
<li>sync_gitlab_issues_local_token: <i>str</i></li>
<li>sync_gitlab_issues_remote_url: <i>url</i></li>
<li>sync_gitlab_issues_remote_token: <i>str</i></li>
</ul>
</div>
</div>

<div id="outline-container-org7b231df" class="outline-4">
<h4 id="org7b231df"><a href="update_date.html">update_date</a></h4>
<div class="outline-text-4" id="text-org7b231df">
<ul class="org-ul">
<li>update_date_set_time: <i>bool</i></li>
<li>update_date_current_time: <i>str</i></li>
<li>update_date_source: <i>url</i></li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
